In [1]:
import pandas as pd

In [2]:
import numpy as np

In [15]:
import matplotlib.pyplot as plt

In [6]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    4
2    4
3    1
4    4
5    0
6    5
7    3
8    4
9    5
dtype: int32

In [8]:
s.value_counts()   # 같은 데이터가 몇 번 반복되는지 확인

4    5
5    2
3    1
1    1
0    1
dtype: int64

In [10]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -2.205941  0.254387  0.191484  1.389662
1 -0.783433  0.199761  0.233217  0.156704
2 -1.757628  0.699665  1.498758  1.965752
3  1.740503  0.305072 -0.497739 -0.468361
4  1.184226 -0.169998 -2.227469  1.301497
5 -0.783387 -1.622823  1.189669  0.038507
6 -0.638327  0.432585  0.077945 -0.144088
7  0.995517 -0.981331  0.131075 -0.730711
8  0.269110 -0.782683  0.156327  0.153352
9  0.318008  0.552060 -0.125730  0.983689

In [11]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -2.205941  0.254387  0.191484  1.389662
 1 -0.783433  0.199761  0.233217  0.156704
 2 -1.757628  0.699665  1.498758  1.965752,
           0         1         2         3
 3  1.740503  0.305072 -0.497739 -0.468361
 4  1.184226 -0.169998 -2.227469  1.301497
 5 -0.783387 -1.622823  1.189669  0.038507
 6 -0.638327  0.432585  0.077945 -0.144088,
           0         1         2         3
 7  0.995517 -0.981331  0.131075 -0.730711
 8  0.269110 -0.782683  0.156327  0.153352
 9  0.318008  0.552060 -0.125730  0.983689]

In [12]:
pd.concat(pieces)     # concat : 하나로 합침

          0         1         2         3
0 -2.205941  0.254387  0.191484  1.389662
1 -0.783433  0.199761  0.233217  0.156704
2 -1.757628  0.699665  1.498758  1.965752
3  1.740503  0.305072 -0.497739 -0.468361
4  1.184226 -0.169998 -2.227469  1.301497
5 -0.783387 -1.622823  1.189669  0.038507
6 -0.638327  0.432585  0.077945 -0.144088
7  0.995517 -0.981331  0.131075 -0.730711
8  0.269110 -0.782683  0.156327  0.153352
9  0.318008  0.552060 -0.125730  0.983689

In [13]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [9]:
# MERGE
# https://datascienceschool.net/view-notebook/7002e92653434bc88c8c026c3449d27b/

In [26]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                 columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                 columns=['letter', 'number'])
pd.concat([df1, df2], ignore_index=True)    # ignore_index : 기본 False

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [18]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])

In [20]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [21]:
pd.concat([df1, df3], join="inner")    # join="inner" : 양쪽 다 존재하는 데이터만 가져옴

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [22]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'geroge']],
                   columns=['animal', 'name'])

In [25]:
pd.concat([df1, df3], axis=1)     # axis=1 : 열기준으로 정렬

  letter  number letter  number animal
0      a       1      c       3    cat
1      b       2      d       4    dog

In [27]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})    # 딕셔너리의 key 값 : columns이름
left                                                            # 딕셔너리의 value 값 : 데이터

   key  lval
0  foo     1
1  bar     2

In [28]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [29]:
pd.merge(left, right)

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [30]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [31]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
    }, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [32]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
    }, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [36]:
pd.merge(df1, df2, how='outer')    # how='outer' : outer join 방식 -> 키 값이 한쪽에만 있어도 데이터를 보여줌
                                  # how='left' : 왼쪽(df1)에만 있는 데이터는 출력되고 오른쪽(df2)에만 있는 데이터는 출력되지 않음 <-> how='right'

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [37]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [38]:
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [39]:
pd.merge(df1, df2, on='고객명')    # 기준 열이 될 수 있는 컬럼이 두개 이상 있으면 on을 이용해 기준 열을 명시
                                   # 기준 열이 아니면서 이름이 같은 열에는 _x 또는 _y 와 같은 접미사가 붙음

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

In [40]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [41]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [42]:
pd.merge(df1, df2, left_on='이름', right_on="성명")

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6